import type { FinalClassNameKey } from '@maple/data-class';

import { type SixthLineageClassGroupSkill } from '@/sixth';
import type { SkillLinkedGroups } from '@/types';

export type SixthLineageClassGroupSkillMap = Partial<Record<SixthLineageClassGroupSkill, SkillLinkedGroups>>;

export const sixthLineageClassGroupSkillOverrides = {} as const satisfies SixthLineageClassGroupSkillMap;

export const sixthLineageClassGroupSkillIdOverrides = {
  hero: {
    '블리츠 실드 VI': ['500001015', '500001016'],
  },
  paladin: {
    '블리츠 실드 VI': ['500001017', '500001018'],
  },
  'dark-knight': {
    '블리츠 실드 VI': ['500001019', '500001020'],
  },
  'arch-mage-fire-poison': {
    '아르카나 오버라이드 VI': ['500001021'],
  },
  'arch-mage-ice-lightning': {
    '아르카나 오버라이드 VI': ['500001022'],
  },
  bishop: {
    '아르카나 오버라이드 VI': ['500001023'],
  },
  'bow-master': {
    '이볼브 VI': ['500001024', '500001025'],
  },
  marksman: {
    '이볼브 VI': ['500001026', '500001027'],
  },
  pathfinder: {
    '이볼브 VI': ['500001028', '500001029'],
  },
  'night-lord': {
    '얼티밋 다크 사이트 VI': ['500001030', '500001031', '500001131'],
  },
  shadower: {
    '얼티밋 다크 사이트 VI': ['500001032', '500001033', '500001132'],
  },
  'dual-blader': {
    '얼티밋 다크 사이트 VI': ['500001034', '500001035', '500001133'],
  },
  viper: {
    '파이렛 플래그 VI': ['500001036'],
  },
  captain: {
    '파이렛 플래그 VI': ['500001037'],
  },
  'cannon-master': {
    '파이렛 플래그 VI': ['500001038'],
  },
  mikhail: {
    '시그너스 팔랑크스 VI': ['500001039', '500001125'],
  },
  'soul-master': {
    '시그너스 팔랑크스 VI': ['500001040', '500001126'],
  },
  'flame-wizard': {
    '시그너스 팔랑크스 VI': ['500001041', '500001127'],
  },
  'wind-breaker': {
    '시그너스 팔랑크스 VI': ['500001042', '500001128'],
  },
  'night-walker': {
    '시그너스 팔랑크스 VI': ['500001043', '500001129'],
  },
  striker: {
    '시그너스 팔랑크스 VI': ['500001044', '500001130'],
  },
  aran: {
    '프리드의 가호 VI': ['500001045', '500001046', '500001047'],
  },
  evan: {
    '프리드의 가호 VI': ['500001048', '500001049', '500001050'],
  },
  luminous: {
    '프리드의 가호 VI': ['500001051', '500001052', '500001053'],
  },
  mercedes: {
    '프리드의 가호 VI': ['500001054', '500001055', '500001056'],
  },
  phantom: {
    '프리드의 가호 VI': ['500001057', '500001058', '500001059'],
  },
  eunwol: {
    '프리드의 가호 VI': ['500001060', '500001061', '500001062'],
  },
  blaster: {
    '레지스탕스 라인 인팬트리 VI': ['500001063'],
  },
  'battle-mage': {
    '레지스탕스 라인 인팬트리 VI': ['500001064'],
  },
  'wild-hunter': {
    '레지스탕스 라인 인팬트리 VI': ['500001065'],
  },
  xenon: {
    '레지스탕스 라인 인팬트리 VI': ['500001066'],
  },
  mechanic: {
    '레지스탕스 라인 인팬트리 VI': ['500001067'],
  },
  'demon-slayer': {
    '콜 마스테마 VI': ['500001068', '500001069', '500001134'],
  },
  'demon-avenger': {
    '콜 마스테마 VI': ['500001070', '500001071', '500001135'],
  },
  kaiser: {
    '판테온 VI': ['500001072', '500001073'],
  },
  kain: {
    '판테온 VI': ['500001074', '500001075'],
  },
  cadena: {
    '판테온 VI': ['500001076', '500001077'],
  },
  'angelic-buster': {
    '판테온 VI': ['500001078', '500001079'],
  },
  zero: {
    '트랜센던트 VI': [
      '500001080',
      '500001081', // 트랜센던트 VI : 빛 - 범위
      '500001082', // 트랜센던트 VI : 빛 - 빛의 창
      '500001083', // 트랜센던트 VI : 빛 - 지속 공격
      '500001084', // 트랜센던트 VI : 생명
      '500001085', // 트랜센던트 VI : 시간
      '500001086',
      '500001087',
      '500001088',
      '500001089',
      '500001090',
      '500001091',
      '500001092',
      '500001093',
      '500001094',
      '500001095',
      '500001096',
      '500001097',
      '500001098',
      '500001099',
      '500001100',
      '500001101',
      '500001102',
      '500001103',
      '500001104',
      '500001105',
    ],
  },
  kinesis: {
    '이계의 잔상 VI': ['500001106'],
  },
  adele: {
    '매직 서킷 풀드라이브 VI': ['500001107', '500001108', '500001109'],
  },
  illium: {
    '매직 서킷 풀드라이브 VI': ['500001110', '500001111', '500001112'],
  },
  khali: {
    '매직 서킷 풀드라이브 VI': ['500001113', '500001114', '500001115'],
  },
  ark: {
    '매직 서킷 풀드라이브 VI': ['500001116', '500001117', '500001118'],
  },
  len: {
    '화중군자 VI': ['500001119', '500001120'],
  },
  lara: {
    '화중군자 VI': ['500001121', '500001122'],
  },
  hoyoung: {
    '화중군자 VI': ['500001123', '500001124'],
  },
} as const satisfies Partial<Record<FinalClassNameKey, Partial<Record<SixthLineageClassGroupSkill, readonly string[]>>>>;
