import type { ClassName } from '@maple/game-data/class';

export const finalClassJobIdMap = {
  히어로: ['000', '100', '110', '111', '112', '114'],
  팔라딘: ['000', '100', '120', '121', '122', '124'],
  다크나이트: ['000', '100', '130', '131', '132', '134'],

  '아크메이지(불,독)': ['000', '200', '210', '211', '212', '214'],
  '아크메이지(썬,콜)': ['000', '200', '220', '221', '222', '224'],
  비숍: ['000', '200', '230', '231', '232', '234'],

  보우마스터: ['000', '300', '310', '311', '312', '314'],
  신궁: ['000', '300', '320', '321', '322', '324'],
  패스파인더: ['000', '301', '330', '331', '332', '334'],

  나이트로드: ['000', '400', '410', '411', '412', '414'],
  섀도어: ['000', '400', '420', '421', '422', '424'],
  듀얼블레이더: ['000', '400', '430', '431', '432', '433', '434', '436'],

  바이퍼: ['000', '500', '510', '511', '512', '514'],
  캡틴: ['000', '500', '520', '521', '522', '524'],
  캐논마스터: ['000', '501', '530', '531', '532', '534'],

  소울마스터: ['1000', '1100', '1110', '1111', '1112', '1114'],
  플레임위자드: ['1000', '1200', '1210', '1211', '1212', '1214'],
  윈드브레이커: ['1000', '1300', '1310', '1311', '1312', '1314'],
  나이트워커: ['1000', '1400', '1410', '1411', '1412', '1414'],
  스트라이커: ['1000', '1500', '1510', '1511', '1512', '1514'],
  미하일: ['5000', '5100', '5110', '5111', '5112', '5114'],

  아란: ['2000', '2100', '2110', '2111', '2112', '2114'],
  에반: ['2001', '2200', '2211', '2214', '2217', '2220'],
  메르세데스: ['2002', '2300', '2310', '2311', '2312', '2314'],
  팬텀: ['2003', '2400', '2410', '2411', '2412', '2414'],
  은월: ['2005', '2500', '2510', '2511', '2512', '2514'],
  루미너스: ['2004', '2700', '2710', '2711', '2712', '2714'],

  데몬슬레이어: ['3001', '3100', '3110', '3111', '3112', '3114'],
  데몬어벤져: ['3001', '3101', '3120', '3121', '3122', '3124'],
  배틀메이지: ['3000', '3200', '3210', '3211', '3212', '3214'],
  와일드헌터: ['3000', '3300', '3310', '3311', '3312', '3314'],
  메카닉: ['3000', '3500', '3510', '3511', '3512', '3514'],
  제논: ['3002', '3600', '3610', '3611', '3612', '3614'],
  블래스터: ['3000', '3700', '3710', '3711', '3712', '3714'],

  카이저: ['6000', '6100', '6110', '6111', '6112', '6114'],
  카인: ['6003', '6300', '6310', '6311', '6312', '6314'],
  카데나: ['6002', '6400', '6410', '6411', '6412', '6414'],
  엔젤릭버스터: ['6001', '6500', '6510', '6511', '6512', '6514'],

  제로: ['10000', '10100', '10110', '10111', '10112', '10114'],
  키네시스: ['14000', '14200', '14210', '14211', '14212', '14214'],

  아델: ['15002', '15100', '15110', '15111', '15112', '15114'],
  일리움: ['15000', '15200', '15210', '15211', '15212', '15214'],
  칼리: ['15003', '15400', '15410', '15411', '15412', '15414'],
  아크: ['15001', '15500', '15510', '15511', '15512', '15514'],

  렌: ['16002', '16100', '16110', '16111', '16112', '16114'],
  라라: ['16001', '16200', '16210', '16211', '16212', '16214'],
  호영: ['16000', '16400', '16410', '16411', '16412', '16414'],
} as const satisfies Partial<Record<ClassName, readonly string[]>>;

export const finalClassFileNameMap = {
  히어로: 'hero',
  팔라딘: 'paladin',
  다크나이트: 'dark-knight',

  '아크메이지(불,독)': 'arch-mage-fire-poison',
  '아크메이지(썬,콜)': 'arch-mage-ice-lightning',
  비숍: 'bishop',

  보우마스터: 'bow-master',
  신궁: 'marksman',
  패스파인더: 'pathfinder',

  나이트로드: 'night-lord',
  섀도어: 'shadower',
  듀얼블레이더: 'dual-blader',

  바이퍼: 'viper',
  캡틴: 'captain',
  캐논마스터: 'cannon-master',

  소울마스터: 'soul-master',
  플레임위자드: 'flame-wizard',
  윈드브레이커: 'wind-breaker',
  나이트워커: 'night-walker',
  스트라이커: 'striker',
  미하일: 'mikhail',

  아란: 'aran',
  에반: 'evan',
  메르세데스: 'mercedes',
  팬텀: 'phantom',
  은월: 'eunwol',
  루미너스: 'luminous',

  데몬슬레이어: 'demon-slayer',
  데몬어벤져: 'demon-avenger',
  배틀메이지: 'battle-mage',
  와일드헌터: 'wild-hunter',
  메카닉: 'mechanic',
  제논: 'xenon',
  블래스터: 'blaster',

  카이저: 'kaiser',
  카인: 'kain',
  카데나: 'cadena',
  엔젤릭버스터: 'angelic-buster',

  제로: 'zero',
  키네시스: 'kinesis',

  아델: 'adele',
  일리움: 'illium',
  칼리: 'khali',
  아크: 'ark',

  렌: 'len',
  라라: 'lara',
  호영: 'hoyoung',
} as const satisfies Record<keyof typeof finalClassJobIdMap, string>;

export const categoryJobIdFileNameMap = {
  '40000': 'fifth-common-and-enhancement',
  '40001': 'fifth-warrior',
  '40002': 'fifth-mage',
  '40003': 'fifth-archer',
  '40004': 'fifth-thief',
  '40005': 'fifth-pirate',
  '50000': 'sixth-common-and-enhancement',
  '50006': 'sixth-special-enhancement',
  '50007': 'hexa-stat',
} as const satisfies Record<string, string>;
