import type { ClassGroup } from './base';
import type { AllClassName, AllClassKey } from './class-group-map';

export type RawJobClassName = AllClassName | readonly AllClassName[];
export type RawJobCategory =
  | {
      kind: 'fifthSkillCore';
      scope: 'all';
      desc: string;
    }
  | {
      kind: 'fifthSkillCore';
      scope: 'classGroup';
      classGroup: ClassGroup;
      desc: string;
    }
  | {
      kind: 'sixthCore';
      scope: 'all';
      desc: string;
    }
  | {
      kind: 'sixthSpecialEnhancementCore';
      scope: 'all';
      desc: string;
    }
  | {
      kind: 'hexaStat';
      scope: 'all';
      desc: string;
    };

export const classJobStages = [0, 1, 1.5, 2, 2.5, 3, 4, 6] as const;
export type ClassJobStage = (typeof classJobStages)[number];
export type ClassJobId = string;
export type ClassJobIdMap = Partial<Record<AllClassKey, Partial<Record<ClassJobStage, Record<ClassJobId, AllClassName>>>>>;

export const classJobIdMap = {
  hero: {
    0: { '000': '초보자' },
    1: { '100': '검사' },
    2: { '110': '파이터' },
    3: { '111': '크루세이더' },
    4: { '112': '히어로' },
    6: { '114': '히어로' },
  },
  paladin: {
    0: { '000': '초보자' },
    1: { '100': '검사' },
    2: { '120': '페이지' },
    3: { '121': '나이트' },
    4: { '122': '팔라딘' },
    6: { '124': '팔라딘' },
  },
  'dark-knight': {
    0: { '000': '초보자' },
    1: { '100': '검사' },
    2: { '130': '스피어맨' },
    3: { '131': '버서커' },
    4: { '132': '다크나이트' },
    6: { '134': '다크나이트' },
  },
  'arch-mage-fire-poison': {
    0: { '000': '초보자' },
    1: { '200': '매지션' },
    2: { '210': '위자드(불,독)' },
    3: { '211': '메이지(불,독)' },
    4: { '212': '아크메이지(불,독)' },
    6: { '214': '아크메이지(불,독)' },
  },
  'arch-mage-ice-lightning': {
    0: { '000': '초보자' },
    1: { '200': '매지션' },
    2: { '220': '위자드(썬,콜)' },
    3: { '221': '메이지(썬,콜)' },
    4: { '222': '아크메이지(썬,콜)' },
    6: { '224': '아크메이지(썬,콜)' },
  },
  bishop: {
    0: { '000': '초보자' },
    1: { '200': '매지션' },
    2: { '230': '클레릭' },
    3: { '231': '프리스트' },
    4: { '232': '비숍' },
    6: { '234': '비숍' },
  },
  'bow-master': {
    0: { '000': '초보자' },
    1: { '300': '아처' },
    2: { '310': '헌터' },
    3: { '311': '레인저' },
    4: { '312': '보우마스터' },
    6: { '314': '보우마스터' },
  },
  marksman: {
    0: { '000': '초보자' },
    1: { '300': '아처' },
    2: { '320': '사수' },
    3: { '321': '저격수' },
    4: { '322': '신궁' },
    6: { '324': '신궁' },
  },
  pathfinder: {
    0: { '000': '초보자' },
    1: { '301': '아처' },
    2: { '330': '에이션트 아처' },
    3: { '331': '체이서' },
    4: { '332': '패스파인더' },
    6: { '334': '패스파인더' },
  },
  'night-lord': {
    0: { '000': '초보자' },
    1: { '400': '로그' },
    2: { '410': '어쌔신' },
    3: { '411': '허밋' },
    4: { '412': '나이트로드' },
    6: { '414': '나이트로드' },
  },
  shadower: {
    0: { '000': '초보자' },
    1: { '400': '로그' },
    2: { '420': '시프' },
    3: { '421': '시프마스터' },
    4: { '422': '섀도어' },
    6: { '424': '섀도어' },
  },
  'dual-blader': {
    0: { '000': '초보자' },
    1: { '400': '로그' },
    1.5: { '430': '세미듀어러' },
    2: { '431': '듀어러' },
    2.5: { '432': '듀얼마스터' },
    3: { '433': '슬래셔' },
    4: { '434': '듀얼블레이더' },
    6: { '436': '듀얼블레이더' },
  },
  viper: {
    0: { '000': '초보자' },
    1: { '500': '해적' },
    2: { '510': '인파이터' },
    3: { '511': '버커니어' },
    4: { '512': '바이퍼' },
    6: { '514': '바이퍼' },
  },
  captain: {
    0: { '000': '초보자' },
    1: { '500': '해적' },
    2: { '520': '건슬링거' },
    3: { '521': '발키리' },
    4: { '522': '캡틴' },
    6: { '524': '캡틴' },
  },
  'cannon-master': {
    0: { '000': '초보자' },
    1: { '501': '해적' },
    2: { '530': '캐논슈터' },
    3: { '531': '캐논블래스터' },
    4: { '532': '캐논마스터' },
    6: { '534': '캐논마스터' },
  },
  'soul-master': {
    0: { '1000': '노블레스' },
    1: { '1100': '소울마스터' },
    2: { '1110': '소울마스터' },
    3: { '1111': '소울마스터' },
    4: { '1112': '소울마스터' },
    6: { '1114': '소울마스터' },
  },
  'flame-wizard': {
    0: { '1000': '노블레스' },
    1: { '1200': '플레임위자드' },
    2: { '1210': '플레임위자드' },
    3: { '1211': '플레임위자드' },
    4: { '1212': '플레임위자드' },
    6: { '1214': '플레임위자드' },
  },
  'wind-breaker': {
    0: { '1000': '노블레스' },
    1: { '1300': '윈드브레이커' },
    2: { '1310': '윈드브레이커' },
    3: { '1311': '윈드브레이커' },
    4: { '1312': '윈드브레이커' },
    6: { '1314': '윈드브레이커' },
  },
  'night-walker': {
    0: { '1000': '노블레스' },
    1: { '1400': '나이트워커' },
    2: { '1410': '나이트워커' },
    3: { '1411': '나이트워커' },
    4: { '1412': '나이트워커' },
    6: { '1414': '나이트워커' },
  },
  striker: {
    0: { '1000': '노블레스' },
    1: { '1500': '스트라이커' },
    2: { '1510': '스트라이커' },
    3: { '1511': '스트라이커' },
    4: { '1512': '스트라이커' },
    6: { '1514': '스트라이커' },
  },
  aran: {
    0: { '2000': '아란' },
    1: { '2100': '아란' },
    2: { '2110': '아란' },
    3: { '2111': '아란' },
    4: { '2112': '아란' },
    6: { '2114': '아란' },
  },
  evan: {
    0: { '2001': '에반' },
    1: { '2200': '에반' },
    2: { '2211': '에반' },
    3: { '2214': '에반' },
    4: { '2217': '에반' },
    6: { '2220': '에반' },
  },
  mercedes: {
    0: { '2002': '메르세데스' },
    1: { '2300': '메르세데스' },
    2: { '2310': '메르세데스' },
    3: { '2311': '메르세데스' },
    4: { '2312': '메르세데스' },
    6: { '2314': '메르세데스' },
  },
  phantom: {
    0: { '2003': '팬텀' },
    1: { '2400': '팬텀' },
    2: { '2410': '팬텀' },
    3: { '2411': '팬텀' },
    4: { '2412': '팬텀' },
    6: { '2414': '팬텀' },
  },
  luminous: {
    0: { '2004': '루미너스' },
    1: { '2700': '루미너스' },
    2: { '2710': '루미너스' },
    3: { '2711': '루미너스' },
    4: { '2712': '루미너스' },
    6: { '2714': '루미너스' },
  },
  eunwol: {
    0: { '2005': '은월' },
    1: { '2500': '은월' },
    2: { '2510': '은월' },
    3: { '2511': '은월' },
    4: { '2512': '은월' },
    6: { '2514': '은월' },
  },
  'demon-slayer': {
    0: { '3001': '데몬슬레이어' },
    1: { '3100': '데몬슬레이어' },
    2: { '3110': '데몬슬레이어' },
    3: { '3111': '데몬슬레이어' },
    4: { '3112': '데몬슬레이어' },
    6: { '3114': '데몬슬레이어' },
  },
  'demon-avenger': {
    0: { '3001': '데몬어벤져' },
    1: { '3101': '데몬어벤져' },
    2: { '3120': '데몬어벤져' },
    3: { '3121': '데몬어벤져' },
    4: { '3122': '데몬어벤져' },
    6: { '3124': '데몬어벤져' },
  },
  'battle-mage': {
    0: { '3000': '시티즌' },
    1: { '3200': '배틀메이지' },
    2: { '3210': '배틀메이지' },
    3: { '3211': '배틀메이지' },
    4: { '3212': '배틀메이지' },
    6: { '3214': '배틀메이지' },
  },
  'wild-hunter': {
    0: { '3000': '시티즌' },
    1: { '3300': '와일드헌터' },
    2: { '3310': '와일드헌터' },
    3: { '3311': '와일드헌터' },
    4: { '3312': '와일드헌터' },
    6: { '3314': '와일드헌터' },
  },
  mechanic: {
    0: { '3000': '시티즌' },
    1: { '3500': '메카닉' },
    2: { '3510': '메카닉' },
    3: { '3511': '메카닉' },
    4: { '3512': '메카닉' },
    6: { '3514': '메카닉' },
  },
  xenon: {
    0: { '3002': '제논' },
    1: { '3600': '제논' },
    2: { '3610': '제논' },
    3: { '3611': '제논' },
    4: { '3612': '제논' },
    6: { '3614': '제논' },
  },
  blaster: {
    0: { '3000': '시티즌' },
    1: { '3700': '블래스터' },
    2: { '3710': '블래스터' },
    3: { '3711': '블래스터' },
    4: { '3712': '블래스터' },
    6: { '3714': '블래스터' },
  },
  mikhail: {
    0: { '5000': '미하일' },
    1: { '5100': '미하일' },
    2: { '5110': '미하일' },
    3: { '5111': '미하일' },
    4: { '5112': '미하일' },
    6: { '5114': '미하일' },
  },
  kaiser: {
    0: { '6000': '카이저' },
    1: { '6100': '카이저' },
    2: { '6110': '카이저' },
    3: { '6111': '카이저' },
    4: { '6112': '카이저' },
    6: { '6114': '카이저' },
  },
  kain: {
    0: { '6003': '카인' },
    1: { '6300': '카인' },
    2: { '6310': '카인' },
    3: { '6311': '카인' },
    4: { '6312': '카인' },
    6: { '6314': '카인' },
  },
  cadena: {
    0: { '6002': '카데나' },
    1: { '6400': '카데나' },
    2: { '6410': '카데나' },
    3: { '6411': '카데나' },
    4: { '6412': '카데나' },
    6: { '6414': '카데나' },
  },
  'angelic-buster': {
    0: { '6001': '엔젤릭버스터' },
    1: { '6500': '엔젤릭버스터' },
    2: { '6510': '엔젤릭버스터' },
    3: { '6511': '엔젤릭버스터' },
    4: { '6512': '엔젤릭버스터' },
    6: { '6514': '엔젤릭버스터' },
  },
  zero: {
    0: { '10000': '제로' },
    1: { '10100': '제로' },
    2: { '10110': '제로' },
    3: { '10111': '제로' },
    4: { '10112': '제로' },
    6: { '10114': '제로' },
  },
  kinesis: {
    0: { '14000': '키네시스' },
    1: { '14200': '키네시스' },
    2: { '14210': '키네시스' },
    3: { '14211': '키네시스' },
    4: { '14212': '키네시스' },
    6: { '14214': '키네시스' },
  },
  adele: {
    0: { '15002': '아델' },
    1: { '15100': '아델' },
    2: { '15110': '아델' },
    3: { '15111': '아델' },
    4: { '15112': '아델' },
    6: { '15114': '아델' },
  },
  illium: {
    0: { '15000': '일리움' },
    1: { '15200': '일리움' },
    2: { '15210': '일리움' },
    3: { '15211': '일리움' },
    4: { '15212': '일리움' },
    6: { '15214': '일리움' },
  },
  khali: {
    0: { '15003': '칼리' },
    1: { '15400': '칼리' },
    2: { '15410': '칼리' },
    3: { '15411': '칼리' },
    4: { '15412': '칼리' },
    6: { '15414': '칼리' },
  },
  ark: {
    0: { '15001': '아크' },
    1: { '15500': '아크' },
    2: { '15510': '아크' },
    3: { '15511': '아크' },
    4: { '15512': '아크' },
    6: { '15514': '아크' },
  },
  len: {
    0: { '16002': '렌' },
    1: { '16100': '렌' },
    2: { '16110': '렌' },
    3: { '16111': '렌' },
    4: { '16112': '렌' },
    6: { '16114': '렌' },
  },
  lara: {
    0: { '16001': '라라' },
    1: { '16200': '라라' },
    2: { '16210': '라라' },
    3: { '16211': '라라' },
    4: { '16212': '라라' },
    6: { '16214': '라라' },
  },
  hoyoung: {
    0: { '16000': '호영' },
    1: { '16400': '호영' },
    2: { '16410': '호영' },
    3: { '16411': '호영' },
    4: { '16412': '호영' },
    6: { '16414': '호영' },
  },
} as const satisfies ClassJobIdMap;

export const fifthSkillCoreMap = {
  common: {
    value: '40000',
    keyword: ['common-skill-core', 'affiliation', 'enhancement-core'],
  },
  warrior: {
    value: '40001',
    keyword: [],
  },
};

/*
 * 500004000: 소드 오브 버닝 소울 강화
 * 직업별로 4개씩
 * 500004208: 망혼검 절기 : 심검 강화 강화
 * */

export const rawJobCategoryMap = {
  '40000': {
    kind: 'fifthSkillCore',
    scope: 'all',
    desc: '공용 5차 스킬 코어, 소속군 5차 스킬 코어, 전직업 강화 코어',
  },
  '40001': {
    kind: 'fifthSkillCore',
    scope: 'classGroup',
    classGroup: '전사',
    desc: '전사 공용 5차 스킬 코어와 전사 직업 전용 5차 스킬 코어',
  },
  '40002': {
    kind: 'fifthSkillCore',
    scope: 'classGroup',
    classGroup: '마법사',
    desc: '마법사 공용 5차 스킬 코어와 마법사 직업 전용 5차 스킬 코어',
  },
  '40003': {
    kind: 'fifthSkillCore',
    scope: 'classGroup',
    classGroup: '궁수',
    desc: '궁수 공용 5차 스킬 코어와 궁수 직업 전용 5차 스킬 코어',
  },
  '40004': {
    kind: 'fifthSkillCore',
    scope: 'classGroup',
    classGroup: '도적',
    desc: '도적 공용 5차 스킬 코어와 도적 직업 전용 5차 스킬 코어',
  },
  '40005': {
    kind: 'fifthSkillCore',
    scope: 'classGroup',
    classGroup: '해적',
    desc: '해적 공용 5차 스킬 코어와 해적 직업 전용 5차 스킬 코어',
  },
  '50000': {
    kind: 'sixthCore',
    scope: 'all',
    desc: '6차 공용 코어와 전직업 6차 강화 코어',
  },
  '50006': {
    kind: 'sixthSpecialEnhancementCore',
    scope: 'all',
    desc: '전직업 6차 강화 코어 중 단순 최종 데미지 증가가 아닌 특수 규칙 코어',
  },
  '50007': {
    kind: 'hexaStat',
    scope: 'all',
    desc: '헥사스탯',
  },
} as const satisfies Record<string, RawJobCategory>;
