const jobCodeMap = [];

const ignoreJobId = ['800', '900', '2210', '2212', '2213', '2214', '2215', '2216', '2218'];

const map = {
  '5***': '미하일',
  '61**': '카이저',
  '63**': '카인',
  '64**': '카데나',
  '65**': '엔젤릭버스터',
};

const ignoreSkillID = [
  71001000,
  71001103,
  70000037, // 타워 공격시 데미지 증가
  70000038, // 해방전 보급 모드 일반 몬스터 공격시 ~
];

const unionSkillID = [71004000, 71004015];

const unionCharacterSkillID = [
  71000011, // 모전
  71000952,
  71000953,
  71000958, // 렌
  71009001, // 메이플 M
];

const abilityID = [70000062];
const monsterLifeSkillId = [72000000, 72000106];
const igonoreSkillIds = {
  guild: {
    jobID: 9100,
    skillIDs: [91000000, 91000007, 91000010, 91001018, 91001019, 91001021],
  },
};

const skillGroup = {
  guild: {
    jobID: 9100,
    noble: [{ 91001022: '보스 킬링 머신' }, { 91001023: '방어력은 숫자일 뿐' }, { 91001024: '길드의 이름으로' }, { 91001025: '크게 한방' }],
  },
};
