export const adventureMageClass = {
  '아크메이지(불,독)': {
    '0': '모험가',
    '1': '매지션',
    '2': '위자드(불,독)',
    '3': '메이지(불,독)',
    '4': '아크메이지(불,독)',
  },
  '아크메이지(썬,콜)': {
    '0': '모험가',
    '1': '매지션',
    '2': '위자드(썬,콜)',
    '3': '메이지(썬,콜)',
    '4': '아크메이지(썬,콜)',
  },
  비숍: {
    '0': '모험가',
    '1': '매지션',
    '2': '클레릭',
    '3': '프리스트',
    '4': '비숍',
  },
};

export const cygnusMageClass = {
  플레임위자드: {
    '0': '노블레스',
    '1': '플레임위자드',
  },
};

export const heroesMageClass = {
  에반: {
    '0': '에반',
    '1': '에반',
  },
  루미너스: {
    '0': '루미너스',
    '1': '루미너스',
  },
};

export const resistanceMageClass = {
  배틀메이지: {
    '0': '시티즌',
    '1': '배틀메이지',
  },
};

export const lefMageClass = {
  일리움: {
    '0': '일리움',
    '1': '일리움',
  },
};

export const animaMageClass = {
  라라: {
    '0': '라라',
    '1': '라라',
  },
};

export const friendsMageClass = {
  키네시스: {
    '0': '키네시스',
    '1': '키네시스',
  },
};
